[
  {
    "postId": "1789",
    "heading": "All Platforms and Cyberfuture",
    "articleUrl": "https://team-reptile.com/all-platforms-and-cyberfuture/",
    "publishDate": "June 27, 2023",
    "publishTime": "12:21 am",
    "author": "Dion Koster",
    "imageCaption": "",
    "videoUrl": "https://www.youtube.com/embed/YAwGzZ-x3H0?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent",
    "content": [
      "Hey everyone, Dion here. As you know 18 Augustus is when Bomb Rush Cyberfunk comes out on Steam and on Nintendo Switch. We are hereby also announcing the game will release on Playstation and Xbox shortly afterwards, making it a full multiplat release.",
      "Right now we are doing the final touches on the game. Making this game has been a great time, a very natural avenue for us and a personal one for me. That is not to say there were no difficulties, but already the fact that I am dancing in my own game certainly makes me feel that it goes beyond the idea of a product. Heading more into having a blast and just expressing ourselves.",
      "This way of thinking has evolved during the course of the development of BRC and I can still see so much more depth to explore in the mixture of street and fiction, cyber and funk. So that’s why, regardless of reception, I would like to formally announce we will be creating more of these type of games after Bomb Rush Cyberfunk.",
      "Have another look at the most recent trailer and see you around:",
      "Pages that are already up:Nintendo eShop: https://www.nintendo.com/store/products/bomb-rush-cyberfunk-switch/Steam: https://store.steampowered.com/app/1353230/Bomb_Rush_Cyberfunk/",
      "And the Team Reptile twitter of course: https://twitter.com/ReptileGames"
    ]
  },
  {
    "postId": "1783",
    "heading": "BRC release date",
    "articleUrl": "https://team-reptile.com/brc-release-date/",
    "publishDate": "June 20, 2023",
    "publishTime": "11:36 am",
    "author": "Team Reptile",
    "imageCaption": "",
    "videoUrl": "https://www.youtube.com/embed/YAwGzZ-x3H0?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent",
    "content": [
      "Can you believe it! We are just 8 weeks away from the release of Bomb Rush Cyberfunk on Augustus 18, 2023. You will be able to play it first on Nintendo Switch & Steam!",
      "Don’t forget to put it on your wishlist if you haven’t already and tell everybody around you what’s coming.  Nintendo eShop: https://www.nintendo.com/store/products/bomb-rush-cyberfunk-switch/Steam: https://store.steampowered.com/app/1353230/Bomb_Rush_Cyberfunk/"
    ]
  },
  {
    "postId": "1758",
    "heading": "Graffiti Battle Winners",
    "articleUrl": "https://team-reptile.com/graffiti-battle-winners/",
    "publishDate": "February 14, 2022",
    "publishTime": "6:34 pm",
    "author": "Team Reptile",
    "imageUrl": "https://www.team-reptile.com/img/GB/GraffitiBattleWinners.jpg",
    "imageCaption": "",
    "content": [
      "Finally, here are the winners of the Bomb Rush Cyberfunk Graffiti Battle!With so many great submissions it was a real challenge to pick our favorites to appear in the game. We did and here they are. Congratulations!In no particular order: Denzel Sterling – evilsk8r – ICKYPATCHI – IMP – Greunouylle – Leo Bruno – HestFTV – Patrick ‘Tek-man’ Gordon – Tius – CHENT SANCHEZ – 3DROD – chobaka – Ed Panopio – Joey Flores – Kelli VDB – TheGreyNinja – Mathew Prada – Lariato Corp – Will Dayer – Tony Riff – 2NES – Jehcee – JOEYREX – PirateGhostDJ – MIKE SUNDAY – REP.SHADE"
    ]
  },
  {
    "postId": "1751",
    "heading": "Graffiti Battle Aftermath",
    "articleUrl": "https://team-reptile.com/graffiti-battle-aftermath/",
    "publishDate": "January 18, 2022",
    "publishTime": "5:36 pm",
    "author": "Team Reptile",
    "imageUrl": "https://www.team-reptile.com/img/GB/GraffitiBattleEntries.png",
    "imageCaption": "Graffiti Battle Aftermath: A maximalism collage of 1157 pieces by more than 700 people. We will announce the runner-ups and after that the winners soon.",
    "content": []
  },
  {
    "postId": "1744",
    "heading": "Move in style",
    "articleUrl": "https://team-reptile.com/move-in-style/",
    "publishDate": "January 5, 2022",
    "publishTime": "5:47 pm",
    "author": "Dion Koster",
    "imageCaption": "",
    "videoUrl": "https://www.youtube.com/embed/r-cE0PK9TeQ?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent",
    "content": [
      "Heya everyone this is Dion Koster from Team Reptile, game director of Bomb Rush Cyberfunk. I hope you are all doing well, I wanted to add a supplement to the new teaser we dropped. First off a shout out to Bx’treme who made the track AGUA we used. I got to admit I didn’t know where the samples were from but it sure sounded dope. Google ‘Agua’ for a quick surprise.",
      "As you know BRC is a game about the street. Wherever you are from, chances are you grew up going out to the local skatepark, scratching your name on the bins at school or hanging out at the mall, dancing, before heading back home to do some extreme tricks in your favorite video game. Maybe it got you to the point that you are now hitting up the big spots in your own way! Bomb Rush Cyberfunk is a big street culture symphony of these feelings. In that spirit I have decided to include skateboarding, BMX and inline skating in the game.",
      "With this teaser we are giving you a heads up, the way that you move around is important. Style is not only about appearance. Many secrets can be found by getting points and doing combos throughout the stage. You will be outstyling the other crews after you bombed their turf to take what’s theirs. Skateboarding, inline and BMX are represented with real life tricks to play into this. After going off you’ll be able to switch back to regular ol’ feet anytime you want to get down to the beat.",
      "This year, we are going in hard to finish the game. Thank you for your patience! As always, no weak shit.",
      "Wishlist the game here: https://store.steampowered.com/app/1353230/Bomb_Rush_Cyberfunk/"
    ]
  },
  {
    "postId": "1720",
    "heading": "Is that a skateboard?",
    "articleUrl": "https://team-reptile.com/is-that-a-skateboard/",
    "publishDate": "August 11, 2021",
    "publishTime": "6:07 pm",
    "author": "Team Reptile",
    "imageCaption": "",
    "videoUrl": "https://www.youtube.com/embed/mrQ-Xc_uEUc?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent",
    "content": [
      "Yes! Skateboarding will be one of the move styles, there will still be more ways to get around. Bomb Rush Cyberfunk will launch on Steam and Nintendo Switch in 2022. Other consoles will follow shortly after. Make sure to add the game to your steam wishlist: https://store.steampowered.com/app/1353230/Bomb_Rush_Cyberfunk/"
    ]
  },
  {
    "postId": "1700",
    "heading": "Second BRC Teaser! … Trailer?",
    "articleUrl": "https://team-reptile.com/second-brc-teaser-trailer/",
    "publishDate": "February 24, 2021",
    "publishTime": "6:10 pm",
    "author": "YinYin",
    "imageCaption": "",
    "videoUrl": "https://www.youtube.com/embed/fckQom8gTvA?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent",
    "content": [
      "The second teaser got more juicy than anticipated! More characters, environments, movement and tagging mechanics are on display!"
    ]
  },
  {
    "postId": "1639",
    "heading": "New Year News",
    "articleUrl": "https://team-reptile.com/new-year-news/",
    "publishDate": "January 22, 2021",
    "publishTime": "1:54 pm",
    "author": "YinYin",
    "imageCaption": "comic by KF2AT",
    "content": [
      "Good day ballers!",
      "We’ve got a lot to catch you up on. From Blaze updates on all platforms, the DLC release status, latest merchandise, events and last but not least: News on Bomb Rush Cyberfunk. So let’s get started!",
      "All console versions have received a major patch, briefly bringing them on par with Steam for a few weeks! Here is the full list of changes and new features:",
      "With that patch live it’s a good time for you to share or update your feedback.",
      "It’s not long now before we have released DLC outfits for every character. Only two more to reveal on Steam. And the ones left for consoles should start rolling out at a faster pace as well.",
      "Here is an overview of where we are at and what order outfits will release in:",
      "Among lots of balance changes and fixes, the latest update on Steam also brought a new ball type: the gravity ball!",
      "Did I say one new ball type? There is a secret second one. You can find it at the end of the arcade mode or using SRSCRDL.",
      "Our latest merch additions are on both eightysixed and whatsneu:A Doombox tee, two undead long sleeved Jerseys, new masks and new hats.",
      "Leading up to and over the holidays the Lethal League community has grown noticeably! If you want to take part in it, here are two upcoming events standing out:",
      "The third New Player Challenge (January 30)(entry limited to sub 200 hour players on Steam)",
      "And the third Quarantined Rapport (February 20)(look out for console tournaments hosted on the same weekend!)",
      "If you wanna partake in either of these or other tournaments,pop into our discord server:",
      "The game has fresh new title art by @dyinginkyotoand you may find a new character in this gif:",
      "But these two are old news by now! What about that second teaser?",
      "All scenes for it are now drafted start to finish, set to a brand new track.And it’s about twice as long as the first one!"
    ]
  },
  {
    "postId": "1573",
    "heading": "A new Bomb Rush Cyberfunk teaser is coming!",
    "articleUrl": "https://team-reptile.com/a-new-bomb-rush-cyberfunk-teaser-is-coming/",
    "publishDate": "November 6, 2020",
    "publishTime": "6:00 pm",
    "author": "YinYin",
    "imageCaption": "",
    "content": [
      "You heard that right! The team is cooking up a second teaser for you.",
      "Until that’s done we still have more to share though.Starting off with one of the crews you will meet:",
      "These stitched up B-Ballers are of mixed heritage and one of the neighbourhoods is their turf.",
      "Next up a new licensed track for the game from Reso, accompanied by another crew:",
      "And before we top this of with some of your work here is some more world building too!",
      "The second collage with some of the great fanart we are receiving!",
      "Looking for word on Lethal League Blaze? We’ll have newsletter dedicated to just that next week. Stay tuned!"
    ]
  },
  {
    "postId": "1542",
    "heading": "DLC Outfit for Sonata & Bomb Rush Cyberfunk progress",
    "articleUrl": "https://team-reptile.com/dlc-outfit-for-sonata-bomb-rush-cyberfunk-progress/",
    "publishDate": "August 29, 2020",
    "publishTime": "6:00 pm",
    "author": "YinYin",
    "imageCaption": "",
    "videoUrl": "https://www.youtube.com/embed/tEx1uz0AOhs?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent",
    "content": [
      "The DLC outfit Stereo Overdrive Arachnida for Sonata is up on steam. But that’s not all. The Doombox Gigahertz Visualizer is now available separately as well. And you can get both these music powered outfits in a bundle together with the soundtrack.",
      "The alternate version of the Stereo Overdrive Arachnida outfit is the Midnight Tinnitus:",
      "Onto Bomb Rush Cyberfunk! We’ve been quite blown away by the amount of fanart already out there and even more so by how quickly it’s being made.",
      "Here are some of our favourites, keep ’em coming!",
      "With more content leaks seeping through from the team, we’ve got some of our own work to share too!",
      "First up: A raw, unedited Dutch interview with Dion … and you are NOT allowed to use google translate on it(?!). Proceed at your own risk.",
      "Next is a preview of what the flip phone for navigation and messaging looks like:",
      "And last but not least: A new environment, billboard and penguin illustrations and a new character!"
    ]
  }
]
